---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetY
source: html/042d4f7f-ca1f-c98f-1cdb-59d569a656ee.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetY Property

"Vertical Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile2OffsetY { get; }
```